### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_app_engine_standard_app_version.fmltc-app-v1 will be updated in-place
!   resource "google_app_engine_standard_app_version" "fmltc-app-v1" {
        id                        = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        name                      = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        # (9 unchanged attributes hidden)


!       deployment {

!           zip {
!               source_url  = "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/6c7d8b5b7d8d682222783d33858c776a.zip" -> "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/ad578fcebe995284e3d2825862a0d4a1.zip"
                # (1 unchanged attribute hidden)
            }
        }


!       handlers {
!           url_regex        = "/favicon.ico" -> "/(.*\\.ico)"
            # (3 unchanged attributes hidden)

!           static_files {
!               expiration            = "86400s" -> "0s"
+               mime_type             = "image/x-icon"
!               path                  = "static/favicon.ico" -> "static/\\1"
!               upload_path_regex     = "static/favicon.ico" -> "static/(.*\\.ico)"
                # (3 unchanged attributes hidden)
            }
        }
!       handlers {
-           redirect_http_response_code = "REDIRECT_HTTP_RESPONSE_CODE_301" -> null
!           security_level              = "SECURE_ALWAYS" -> "SECURE_OPTIONAL"
!           url_regex                   = "/.*" -> "/(.*\\.txt)"
            # (2 unchanged attributes hidden)

-           script {
-               script_path = "auto" -> null
            }

+           static_files {
+               expiration        = "0s"
+               mime_type         = "plain/text"
+               path              = "static/\\1"
+               upload_path_regex = "static/(.*\\.txt)"
            }
        }
!       handlers {
+           redirect_http_response_code = "REDIRECT_HTTP_RESPONSE_CODE_301"
!           security_level              = "SECURE_OPTIONAL" -> "SECURE_ALWAYS"
!           url_regex                   = ".*" -> "/.*"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }


        # (6 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.perform-action will be updated in-place
!   resource "google_cloudfunctions_function" "perform-action" {
        id                    = "projects/ftc-ml-firstinspires-dev/locations/us-central1/functions/perform_action"
        name                  = "perform_action"
!       source_archive_object = "24ad83cd83ddb756bd83a070ac191aaf.zip" -> "33ab1717864c612c506e4ab5cb29679c.zip"
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.dev.google_storage_bucket_object.app-server-archive must be replaced
-/+ resource "google_storage_bucket_object" "app-server-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "o+++QQ==" -> (known after apply)
!       detect_md5hash   = "bH2LW32NaCIieD0zhYx3ag==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gae-source-6c7d8b5b7d8d682222783d33858c776a.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "bH2LW32NaCIieD0zhYx3ag==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/6c7d8b5b7d8d682222783d33858c776a.zip?generation=1636481455353570&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "6c7d8b5b7d8d682222783d33858c776a.zip" -> "ad578fcebe995284e3d2825862a0d4a1.zip" # forces replacement
!       output_name      = "6c7d8b5b7d8d682222783d33858c776a.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/6c7d8b5b7d8d682222783d33858c776a.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.cloud-function-archive must be replaced
-/+ resource "google_storage_bucket_object" "cloud-function-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "j8yL2Q==" -> (known after apply)
!       detect_md5hash   = "JK2DzYPdt1a9g6BwrBkarw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gcf-source-24ad83cd83ddb756bd83a070ac191aaf.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "JK2DzYPdt1a9g6BwrBkarw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/24ad83cd83ddb756bd83a070ac191aaf.zip?generation=1636481455492732&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "24ad83cd83ddb756bd83a070ac191aaf.zip" -> "33ab1717864c612c506e4ab5cb29679c.zip" # forces replacement
!       output_name      = "24ad83cd83ddb756bd83a070ac191aaf.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/24ad83cd83ddb756bd83a070ac191aaf.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>